src/DataProcessors/РазборВопросов5/РазборВопросов5.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РазборВопросов5</name>
</mdclass:DataProcessor>

src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <basedOn>Catalog.Контрагенты</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаказовПоставщикам</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/РазборВопросов5/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СоздатьЗаказПоставщику(Команда)
	СоздатьЗаказПоставщикуНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаказПоставщикуНаСервере()
	
	НовыйЗаказ = Документы.ЗаказПоставщику.СоздатьДокумент();
	НовыйЗаказ.Дата = ТекущаяДата();
	
	ДанныеЗаполнения = Новый Структура;
	
	ДанныеЗаполнения.Вставить("Организация", Организация);
	ДанныеЗаполнения.Вставить("Контрагент", Контрагент);
	ДанныеЗаполнения.Вставить("Номенклатура", Номенклатура);
	
	НовыйЗаказ.Заполнить(ДанныеЗаполнения);//событие ОбработкаЗаполнения
	
	НовыйЗаказ.Записать();
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Создан документ: " + НовыйЗаказ.Ссылка;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьРасширениеФайла(Команда)
	
	ПутьКФайлу = "E:\JAVASCRIPTCORE.RESOURCES1\Info.plist";
	МассивСлов = СтрРазделить(ПутьКФайлу, ".", Истина);
	Если МассивСлов.Количество() > 0 Тогда
		ИндексПоследнего = МассивСлов.ВГраница();
		Расширение = МассивСлов[ИндексПоследнего];
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл имеет расширение " + ВРег(Расширение);
		Сообщение.Сообщить();
	КонецЕсли; 
	
КонецПроцедуры










&НаКлиенте
Процедура ВыполнитьПроцедуруОбщегоМодуля(Команда)
	ВыполнитьПроцедуруОбщегоМодуляНаСервере();
	ТестовыйМодуль.ПоказатьТекстСообщения();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроцедуруОбщегоМодуляНаСервере()
	ТестовыйМодуль.ПоказатьТекстСообщения();
КонецПроцедуры
